index.org
#+TITLE: CSS for Org-exported HTML
#+OPTIONS: toc:nil num:4 H:4 ^:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/normalize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/style.css"/>
#+MACRO: TeX @@html:<span class="tex">T<sub>e</sub>X</span>@@
#+MACRO: LaTeX @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@
#+MACRO: kbd @@html:<kbd>$1</kbd>@@

-----

#+BEGIN_ABSTRACT
This article shows off my org.css, a simple and clean stylesheet for
org-exported HTML file.  My org template for blogging is also
provided.  The configuration of blogging with org mode is omitted for
brevity.
#+END_ABSTRACT

#+TOC: headlines 3

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: sec:introduction
  :END:

  #+BEGIN_QUOTE
  [[http://orgmode.org/][Org mode]] is for keeping notes[fn:1], maintaining TODO lists, planning
  projects, and authoring documents with a fast and effective
  /plain-text/ system[fn:2] \cite{orgmode}.
  #+END_QUOTE

  Org mode is a built-in major mode in [[http://www.gnu.org/software/emacs/][Emacs]].  It's similar to
  [[http://daringfireball.net/projects/markdown/syntax][markdown]] where all editing is done in plain text with some character
  markups to decorate texts and finally the text file can be compiled
  or exported to some other formats.  The philosophy is that we can
  concentrate on the contents with as few distraction from the styles
  as possible, i.e., as easy-to-read and easy-to-write as is feasible
  \cite{markdown}.  However, markdown is just a markup language for
  web writers, while org mode provides much richer functionality
  beyond simple text markup.  For a full introduction to org mode,
  please refer to [[http://orgmode.org/][orgmode.org]] or Emacs manual.  In this article, we
  focus on one of its uses, /exporting to html/.

  I will assume that readers are already familiar with Emacs and org
  mode.  In Section [[#sec:moti]] I provide the motivation for this short
  demo.  All related configuration and templates are detailed in
  Section [[#sec:setup]].  And finally Section [[#sec:con]] concludes this
  article.

* Motivation
  :PROPERTIES:
  :CUSTOM_ID: sec:motivation
  :END:

  As a heavy Emacs user, [[https://www.google.com/search?q%3Dblogging%2Bwith%2Borg%2Bmode][blogging with org mode]] is a natural choice.
  Since I'm keeping notes and ideas in org mode, and some of them I
  may want to publish online.  Questions like why not use products
  like MS OneNote or Google Keep or Wordpress or whatever simply boil
  down to personal preference.  Org file is a simple text file which
  can be processed efficiently by external programs.  It has good
  built-in support from Emacs, and can be exported to various formats,
  including /tex/, /pdf/ and /html/.  Except for some special cases
  where dedicated styles are needed, say academic papers, the default
  export styles with simple tweaks usually satisfy my needs.  However,
  the default style provided by org html exporter is simple /boring/.
  So I decide to tweak the stylesheet a little bit to make it /clean/,
  /simple/ and more /eye appealing/.

  Souce code of this file is available at
  https://github.com/gongzhitaao/orgcss.

* Setup
  :PROPERTIES:
  :CUSTOM_ID: sec:setup
  :END:

  Publishing with org mode can be achieved as simple as a few
  keystrokes (say {{{kbd(C-c C-e h h)}}} for html exporting and
  {{{kbd(C-c C-e l p)}}} for pdf exporting).  We omit the publishing
  configuration as the main goal of this article is to demo my
  stylesheet.  The process can be meticulously tweaked following the
  [[http://orgmode.org/manual/Publishing.html#Publishing][instruction here.]]  Actually in my current setup, no tweaks and
  special configurations are needed.  All remains default and works
  out of the box.

** External Utilities
   :PROPERTIES:
   :CUSTOM_ID: sec:external-utilities
   :END:

   Table [[tab:util]] list all the external utilities I used for
   publishing and rendering.

   #+CAPTION: Utilities
   #+NAME: tab:util
   | Utility     | Description                                     |
   |-------------+-------------------------------------------------|
   | [[https://www.lri.fr/~filliatr/bibtex2html/][bibtex2html]] | Export citations in bib files, if any, to html. |
   | [[https://www.mathjax.org/][MathJax]]     | Render math equations.                          |

   Here are some notes about the above utility.

   - Bibtex2html is optional if no citation is required.  Citation
        syntax is the same as in {{{LaTeX}}}, i.e., =\cite{key}=.  To
        use this functionality, you should include the following elisp
        code in your org configuration.

        #+BEGIN_SRC emacs-lisp
(require 'ox-bibtex)
        #+END_SRC

   - I use [[https://www.mathjax.org/][MathJax]] inline rendering for equations despite of its
        speed.  It is rumored that [[http://khan.github.io/KaTeX/][KaTeX]] loads and renders much faster
        than MathJax, but the latter supports only a subset of
        {{{LaTeX}}} syntax.  See the [[http://www.intmath.com/cg5/katex-mathjax-comparison.php][comparison]] between the two.
        Anyway, I do not have that many equations to show off.

