index.html
<!DOCTYPE html>
<html>
<head>
<title>CSS for Org-exported HTML</title>
<!-- 2015-10-23 Fri 16:51 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Zhitao Gong">
<link rel="stylesheet" type="text/css" href="http://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="org.css"/>
<link rel="stylesheet" type="text/css" href="css/style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CSS for Org-exported HTML</h1>
<div class="abstract">
<p>
This article shows off my <a href="http:./org.css">org.css</a>, a simple and clean stylesheet for
org-exported HTML file based on <a href="https://necolas.github.io/normalize.css/">normalize.css</a>.  My org template for
blogging is also provided.  However the configuration of blogging with
org mode is omitted for brevity.
</p>

</div>

<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec:introduction">1. Introduction</a></li>
<li><a href="#sec:motivation">2. Motivation</a></li>
<li><a href="#sec:setup">3. Setup</a>
<ul>
<li><a href="#sec:external-utilities">3.1. External Utilities</a></li>
<li><a href="#sec:org-templates">3.2. Org Templates</a></li>
</ul>
</li>
<li><a href="#sec:known-issues">4. Known Issues</a>
<ul>
<li><a href="#sec:bib-links">4.1. Bib Links</a></li>
<li><a href="#sec:dangling-element">4.2. Dangling Element</a></li>
<li><a href="#sec:bibliograph-in-wrong-section">4.3. Bibliography in Wrong Section</a></li>
<li><a href="#sec:wrong-back-reference">4.4. Wrong Back Reference</a></li>
</ul>
</li>
<li><a href="#sec:conclusion">5. Conclusion</a></li>
</ul>
</div>
</nav>

<div id="outline-container-sec:introduction" class="outline-2">
<h2 id="sec:introduction"><a id="sec-1" name="sec-1"></a><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-sec:introduction">

<blockquote>
<p>
<a href="http://orgmode.org/">Org mode</a> is for keeping notes<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>, maintaining TODO lists, planning
projects, and authoring documents with a fast and effective
<i>plain-text</i> system<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>
</blockquote>

<p>
Org mode is a built-in major mode in <a href="http://www.gnu.org/software/emacs/">Emacs</a>.  It's similar to
<a href="http://daringfireball.net/projects/markdown/syntax">markdown</a> where all editing is done in plain text with some character
markups to decorate texts and finally the text file can be compiled
or exported to some other formats.  The philosophy is that we can
concentrate on the contents with as few distraction from the styles
as possible, i.e., as easy-to-read and easy-to-write as is feasible.
However, markdown is just a markup language for web writers, while
org mode provides much richer functionality beyond simple text
markup.  For a full introduction to org mode, please refer to
<a href="http://orgmode.org/">orgmode.org</a> or Emacs manual.  In this article, we focus on one of
its uses, <i>exporting to html</i>.
</p>

<p>
I will assume that readers are already familiar with Emacs and org
mode.  In Section <a href="#sec:motivation">2</a> I provide the motivation for this
short demo.  All related configuration and templates are detailed in
Section <a href="#sec:setup">3</a>.  And finally Section <a href="#sec:conclusion">5</a> concludes
this article.
</p>
</div>
</div>

<div id="outline-container-sec:motivation" class="outline-2">
<h2 id="sec:motivation"><a id="sec-2" name="sec-2"></a><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-sec:motivation">

<p>
As a heavy Emacs user, <a href="https://www.google.com/search?q=blogging+with+org+mode">blogging with org mode</a> is a natural choice.
Since I'm keeping notes and ideas in org mode, and some of them I
may want to publish online.  Questions like why not use products
like MS OneNote or Google Keep or Wordpress or whatever simply boil
down to personal preference.  Org file is a simple text file which
can be processed efficiently by external programs.  It has good
built-in support from Emacs, and can be exported to various formats,
including <i>tex</i>, <i>pdf</i> and <i>html</i>.  Except for some special cases
where dedicated styles are needed, say academic papers, the default
export styles with simple tweaks usually satisfy my needs.  However,
the default style provided by org html exporter is simple <i>boring</i>.
So I decide to tweak the stylesheet a little bit to make it <i>clean</i>,
<i>simple</i> and more <i>eye appealing</i>.
</p>

<p>
Souce code of this file is available at
<a href="https://github.com/gongzhitaao/orgcss">https://github.com/gongzhitaao/orgcss</a>.
</p>
</div>
</div>

<div id="outline-container-sec:setup" class="outline-2">
<h2 id="sec:setup"><a id="sec-3" name="sec-3"></a><span class="section-number-2">3</span> Setup</h2>
<div class="outline-text-2" id="text-sec:setup">

<p>
Publishing with org mode can be achieved as simple as a few
keystrokes (say <kbd>C-c C-e h h</kbd> for html exporting and
<kbd>C-c C-e l p</kbd> for pdf exporting).  We omit the publishing
configuration as the main goal of this article is to demo my
stylesheet.  The process can be meticulously tweaked following the
<a href="http://orgmode.org/manual/Publishing.html#Publishing">instruction here.</a>  Actually in my current setup, no tweaks and
special configurations are needed.  All remains default and works
out of the box.
</p>
</div>

<div id="outline-container-sec:external-utilities" class="outline-3">
<h3 id="sec:external-utilities"><a id="sec-3-1" name="sec-3-1"></a><span class="section-number-3">3.1</span> External Utilities</h3>
<div class="outline-text-3" id="text-sec:external-utilities">

<p>
Table <a href="#tab:util">1</a> list all the external utilities I used for
publishing and rendering.
</p>

<table id="tab:util">
<caption class="t-above"><span class="table-number">Table 1:</span> Utilities</caption>

<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Utility</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="https://www.lri.fr/~filliatr/bibtex2html/">bibtex2html</a></td>
<td class="left">Export citations in bib files, if any, to html.</td>
</tr>

<tr>
<td class="left"><a href="https://www.mathjax.org/">MathJax</a></td>
<td class="left">Render math equations.</td>
</tr>
</tbody>
</table>

<p>
Here are some notes about the above utility.
</p>

<ul class="org-ul">
<li>Bibtex2html is optional if no citation is required.  Citation
syntax is the same as in <span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>, i.e., <code>\cite{key}</code>.  To
use this functionality, you should include the following elisp
code in your org configuration.

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #729fcf; font-weight: bold;">require</span> '<span style="color: #73d216;">ox-bibtex</span>)
</pre>
</div>
</li>

<li>I use <a href="https://www.mathjax.org/">MathJax</a> inline rendering for equations despite of its
speed.  It is rumored that <a href="http://khan.github.io/KaTeX/">KaTeX</a> loads and renders much faster
than MathJax, but the latter supports only a subset of
<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span> syntax.  See the <a href="http://www.intmath.com/cg5/katex-mathjax-comparison.php">comparison</a> between the two.
Anyway, I do not have that many equations to show off.
</li>
</ul>
</div>
</div>
