index.org
** Org Templates
   :PROPERTIES:
   :CUSTOM_ID: sec:org-templates
   :END:

   The following is my org file template for blogging.

   #+BEGIN_SRC org
,#+TITLE: Article Title Goes Here
,#+OPTIONS: toc:nil num:t tex:dvipng
,#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/normalize.css"/>
,#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css"/>

# Separate the title with the content
-----

,#+BEGIN_ABSTRACT
Article abstract goes here.
,#+END_ABSTRACT

# now prints out the previously disabled (toc:nil) table of contents.
,#+TOC: headlines 3

Your content goes here.

# separate the body with the footnotes and reference
-----

# prints out bibliograph, if any, with bibtex2html.  The first
# parameter is the bibliograph file name without .bib extension, the
# second is the reference style.
,#+BIBLIOGRAPHY: bib-file plain

# This is an automatically generated section is you use footnote.
,* Footnotes
  #+END_SRC

   With all these setup, only one thing is left, i.e., tweaking the
   styles of exported html.  By default, The HTML exporter assigns
   some [[http://orgmode.org/manual/CSS-support.html][special CSS classes]] to appropriate parts of the document and
   your style specifications may change these, in addition to any of
   the standard classes like for headlines, tables, etc.  The list is
   actually not complete, you may want to export a test org file and
   read the source of exported html file to find out what classes are
   available.  The current page shows off my org.css.  Some other good
   styles for org-exported html can be found on [[http://orgmode.org/]],
   [[http://doc.norang.ca/org-mode.html]] and etc.

* Known Issues
  :PROPERTIES:
  :CUSTOM_ID: sec:known-issues
  :END:

  The citation exporter, =ox-bibtex=, does NOT work seamlessly.  As of
  =Org-mode version 8.2.10=, I have the following issues.

** Bib Links
   :PROPERTIES:
   :CUSTOM_ID: sec:bib-links
   :END:

  For ref.bib, =bibtex2html= generates two files, ref.html and
  ref_bib.html.  Links in the two files are redirected to each other.
  For example, the bib link in ref_bib.html links to appropriate
  section in ref.html and key in ref.html links back to ref_bib.html.
  =ox-bibtex= ignores this and copies the content of ref.html directly
  to the exported html file.  So here comes the problem.  In the
  exported html, everything works fine but when you try to go and see
  the bib source of a citation, you will be directed to ref_bib.html,
  and then when you try to get back from ref_bib.html by the key, you
  get directed to ref.html instead of the generated
  document. Currently there is no elegant solution yet except hacking
  some code to post-process the generated document.

** Dangling Element
   :PROPERTIES:
   :CUSTOM_ID: sec:dangling-element
   :END:
   The lisp function =insert-file-contents= used in =ox-bibtex= does
   not move point and insertion-marker to the end of inserted text
   (I'm not sure it is a bug or an intention).  The result is that the
   citation is a dangling table not included in the bibliography div.

   The expected result is

   #+BEGIN_SRC html
<div id="bibliography">
  <h2>Bibliography</h2>
  <table>
  <!-- Citation content goes here -->
  </table>
</div>
   #+END_SRC

   But we got

   #+BEGIN_SRC html
<div id="bibliography">
  <h2>Bibliography</h2>
</div>
<table>
<!-- Citation content goes here -->
</table>
   #+END_SRC

   Unless a patch is submitted, we may need to manually adjust this
   weird result.

