index.html

<div id="outline-container-sec:org-templates" class="outline-3">
<h3 id="sec:org-templates"><a id="sec-3-2" name="sec-3-2"></a><span class="section-number-3">3.2</span> Org Templates</h3>
<div class="outline-text-3" id="text-sec:org-templates">

<p>
The following is my org file template for blogging.
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #babdb6;">#+TITLE:</span> <span style="color: #729fcf; font-size: 140%; font-weight: bold;">Article Title Goes Here</span>
<span style="color: #babdb6; font-style: italic;">#+OPTIONS: toc:nil num:t tex:dvipng</span>
<span style="color: #babdb6; font-style: italic;">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="css/normalize.css"/&gt;</span>
<span style="color: #babdb6; font-style: italic;">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="org.css"/&gt;</span>

<span style="color: #babdb6; font-style: italic;"># Separate the title with the content</span>
-----

<span style="color: #babdb6; font-style: italic;">#+BEGIN_ABSTRACT</span>
Article abstract goes here.
<span style="color: #babdb6; font-style: italic;">#+END_ABSTRACT</span>

<span style="color: #babdb6; font-style: italic;"># now prints out the previously disabled (toc:nil) table of contents.</span>
<span style="color: #babdb6; font-style: italic;">#+TOC: headlines 3</span>

Your content goes here.

<span style="color: #babdb6; font-style: italic;"># separate the body with the footnotes and reference</span>
-----

<span style="color: #babdb6; font-style: italic;"># prints out bibliograph, if any, with bibtex2html.  The first</span>
<span style="color: #babdb6; font-style: italic;"># parameter is the bibliograph file name without .bib extension, the</span>
<span style="color: #babdb6; font-style: italic;"># second is the reference style.</span>
<span style="color: #babdb6; font-style: italic;">#+BIBLIOGRAPHY: bib-file plain</span>

<span style="color: #babdb6; font-style: italic;"># This is an automatically generated section is you use footnote.</span>
<span style="color: #729fcf; font-size: 130%; font-weight: bold;">* Footnotes</span>
</pre>
</div>

<p>
With all these setup, only one thing is left, i.e., tweaking the
styles of exported html.  By default, The HTML exporter assigns
some <a href="http://orgmode.org/manual/CSS-support.html">special CSS classes</a> to appropriate parts of the document and
your style specifications may change these, in addition to any of
the standard classes like for headlines, tables, etc.  The list is
actually not complete, you may want to export a test org file and
read the source of exported html file to find out what classes are
available.  The current page shows off my org.css.  Some other good
styles for org-exported html can be found on <a href="http://orgmode.org/">http://orgmode.org/</a>,
<a href="http://doc.norang.ca/org-mode.html">http://doc.norang.ca/org-mode.html</a> and etc.
</p>
</div>
</div>
</div>

<div id="outline-container-sec:known-issues" class="outline-2">
<h2 id="sec:known-issues"><a id="sec-4" name="sec-4"></a><span class="section-number-2">4</span> Known Issues</h2>
<div class="outline-text-2" id="text-sec:known-issues">

<p>
The citation exporter, <code>ox-bibtex</code>, does NOT work seamlessly.  As of
<code>Org-mode version 8.2.10</code>, I have the following issues.
</p>
</div>

<div id="outline-container-sec:bib-links" class="outline-3">
<h3 id="sec:bib-links"><a id="sec-4-1" name="sec-4-1"></a><span class="section-number-3">4.1</span> Bib Links</h3>
<div class="outline-text-3" id="text-sec:bib-links">

<p>
For ref.bib, <code>bibtex2html</code> generates two files, ref.html and
ref_bib.html.  Links in the two files are redirected to each other.
For example, the bib link in ref_bib.html links to appropriate
section in ref.html and key in ref.html links back to ref_bib.html.
<code>ox-bibtex</code> ignores this and copies the content of ref.html directly
to the exported html file.  So here comes the problem.  In the
exported html, everything works fine but when you try to go and see
the bib source of a citation, you will be directed to ref_bib.html,
and then when you try to get back from ref_bib.html by the key, you
get directed to ref.html instead of the generated
document. Currently there is no elegant solution yet except hacking
some code to post-process the generated document.
</p>
</div>
</div>

<div id="outline-container-sec:dangling-element" class="outline-3">
<h3 id="sec:dangling-element"><a id="sec-4-2" name="sec-4-2"></a><span class="section-number-3">4.2</span> Dangling Element</h3>
<div class="outline-text-3" id="text-sec:dangling-element">
<p>
The lisp function <code>insert-file-contents</code> used in <code>ox-bibtex</code> does
not move point and insertion-marker to the end of inserted text
(I'm not sure it is a bug or an intention).  The result is that the
citation is a dangling table not included in the bibliography div.
</p>

<p>
The expected result is
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"bibliography"</span>&gt;
  &lt;<span style="color: #fcaf3e; font-weight: bold;">h2</span>&gt;<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Bibliography</span>&lt;/<span style="color: #fcaf3e; font-weight: bold;">h2</span>&gt;
  &lt;<span style="color: #fcaf3e; font-weight: bold;">table</span>&gt;
  <span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">Citation content goes here </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
  &lt;/<span style="color: #fcaf3e; font-weight: bold;">table</span>&gt;
&lt;/<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
</pre>
</div>

<p>
But we got
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"bibliography"</span>&gt;
  &lt;<span style="color: #fcaf3e; font-weight: bold;">h2</span>&gt;<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Bibliography</span>&lt;/<span style="color: #fcaf3e; font-weight: bold;">h2</span>&gt;
&lt;/<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
&lt;<span style="color: #fcaf3e; font-weight: bold;">table</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">Citation content goes here </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
&lt;/<span style="color: #fcaf3e; font-weight: bold;">table</span>&gt;
</pre>
</div>

<p>
Unless a patch is submitted, we may need to manually adjust this
weird result.
</p>
</div>
</div>
