index.org
** Bibliography in Wrong Section
   :PROPERTIES:
   :CUSTOM_ID: sec:bibliograph-in-wrong-section
   :END:

   The exported bibliography is always included in some other section
   div instead of a stand-lone section.

   The expected result is

   #+BEGIN_SRC html
<div id="outline-container-1" class="outline-2">
<!-- section 1 -->
<div>
<div id="outline-container-2" class="outline-2">
<!-- section 2 -->
<div>
<div id="outline-container-3" class="outline-2">
<!-- section 3 -->
<div>
<div id="bibliography">
<!-- bibliography goes here -->
<div>
   #+END_SRC

   But we got

   #+BEGIN_SRC html
<div id="outline-container-1" class="outline-2">
<!-- section 1 -->
<div>
<div id="outline-container-2" class="outline-2">
<!-- section 2 -->
<div>
<div id="outline-container-3" class="outline-2">
<!-- section 3 -->
  <div id="bibliography">
  <!-- bibliography goes here -->
  <div>
<div>
   #+END_SRC

   The problem is that the following command

   #+BEGIN_SRC org
,#+BIBLIOGRAPHY ref plain
   #+END_SRC

   is always ignored unless it is belonged to a section.  This is due
   to the internal implementation of keyword parser of =ox-html=.
   Currently hacking some post-processing code is the only solution if
   you do not want to do it manually.

** Wrong Back Reference
   :PROPERTIES:
   :CUSTOM_ID: sec:wrong-back-reference
   :END:

   The links generated by =ox-bibtex= is also troublesome.  Given
   =ref.bib=, =bibtex2html= will generate two files, =reb_bib.html=
   and =ref.html=.  The utility =ox-bibtex= directly inserts contents
   of =ref.html= to the current exported html.  Now when you click
   links in the exported html, you will be directed to =ref_bib.html=.
   And when expecting to get back to the exported html by clicking
   links in =ref_bib.html=, you will be instead directed to
   =ref.html=.  It is not a big deal, but just annoying.  I would
   use links instead of citations whenever possible.

* Conclusion
  :PROPERTIES:
  :CUSTOM_ID: sec:conclusion
  :END:

  This article essentially demonstrates my stylesheet for org-exported
  html file without going into details about the publishing process
  which requires some knowledge about Emacs and org mode.  There are
  some dangling issues around the citation with =ox-bibtex=, to which
  the simple solution is to use links instead of citations, if
  possible.  Otherwise, hacking some post-processing code is
  necessary.

-----

* Footnotes

[fn:1] For note keeping, [[http://jblevins.org/projects/deft/][Deft]] with Orgmode make a cute couple.

[fn:2] A [[http://doc.norang.ca/org-mode.html][great article]] elaborates on this.

#+BIBLIOGRAPHY: ref plain
