index.html

<div id="outline-container-sec:bibliograph-in-wrong-section" class="outline-3">
<h3 id="sec:bibliograph-in-wrong-section"><a id="sec-4-3" name="sec-4-3"></a><span class="section-number-3">4.3</span> Bibliography in Wrong Section</h3>
<div class="outline-text-3" id="text-sec:bibliograph-in-wrong-section">

<p>
The exported bibliography is always included in some other section
div instead of a stand-lone section.
</p>

<p>
The expected result is
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"outline-container-1"</span> <span style="color: #ff2929;">class</span>=<span style="color: #de7fa8;">"outline-2"</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">section 1 </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"outline-container-2"</span> <span style="color: #ff2929;">class</span>=<span style="color: #de7fa8;">"outline-2"</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">section 2 </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"outline-container-3"</span> <span style="color: #ff2929;">class</span>=<span style="color: #de7fa8;">"outline-2"</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">section 3 </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"bibliography"</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">bibliography goes here </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
</pre>
</div>

<p>
But we got
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"outline-container-1"</span> <span style="color: #ff2929;">class</span>=<span style="color: #de7fa8;">"outline-2"</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">section 1 </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"outline-container-2"</span> <span style="color: #ff2929;">class</span>=<span style="color: #de7fa8;">"outline-2"</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">section 2 </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"outline-container-3"</span> <span style="color: #ff2929;">class</span>=<span style="color: #de7fa8;">"outline-2"</span>&gt;
<span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">section 3 </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
  &lt;<span style="color: #fcaf3e; font-weight: bold;">div</span> <span style="color: #ff2929;">id</span>=<span style="color: #de7fa8;">"bibliography"</span>&gt;
  <span style="color: #babdb6; font-style: italic;">&lt;!-- </span><span style="color: #babdb6; font-style: italic;">bibliography goes here </span><span style="color: #babdb6; font-style: italic;">--&gt;</span>
  &lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
&lt;<span style="color: #fcaf3e; font-weight: bold;">div</span>&gt;
</pre>
</div>

<p>
The problem is that the following command
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #babdb6; font-style: italic;">#+BIBLIOGRAPHY ref plain</span>
</pre>
</div>

<p>
is always ignored unless it is belonged to a section.  This is due
to the internal implementation of keyword parser of <code>ox-html</code>.
Currently hacking some post-processing code is the only solution if
you do not want to do it manually.
</p>
</div>
</div>

<div id="outline-container-sec:wrong-back-reference" class="outline-3">
<h3 id="sec:wrong-back-reference"><a id="sec-4-4" name="sec-4-4"></a><span class="section-number-3">4.4</span> Wrong Back Reference</h3>
<div class="outline-text-3" id="text-sec:wrong-back-reference">

<p>
The links generated by <code>ox-bibtex</code> is also troublesome.  Given
<code>ref.bib</code>, <code>bibtex2html</code> will generate two files, <code>reb_bib.html</code>
and <code>ref.html</code>.  The utility <code>ox-bibtex</code> directly inserts contents
of <code>ref.html</code> to the current exported html.  Now when you click
links in the exported html, you will be directed to <code>ref_bib.html</code>.
And when expecting to get back to the exported html by clicking
links in <code>ref_bib.html</code>, you will be instead directed to
<code>ref.html</code>.  It is not a big deal, but just annoying.  I would
use links instead of citations whenever possible.
</p>
</div>
</div>
</div>

<div id="outline-container-sec:conclusion" class="outline-2">
<h2 id="sec:conclusion"><a id="sec-5" name="sec-5"></a><span class="section-number-2">5</span> Conclusion</h2>
<div class="outline-text-2" id="text-sec:conclusion">

<p>
This article essentially demonstrates my stylesheet for org-exported
html file without going into details about the publishing process
which requires some knowledge about Emacs and org mode.  There are
some dangling issues around the citation with <code>ox-bibtex</code>, to which
the simple solution is to use links instead of citations, if
possible.  Otherwise, hacking some post-processing code is
necessary.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
For note keeping, <a href="http://jblevins.org/projects/deft/">Deft</a> with Orgmode make a cute couple.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
A <a href="http://doc.norang.ca/org-mode.html">great article</a> elaborates on this.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<a class="author"
         href="http://gongzhitaao.org">Zhitao Gong</a> / <span
         class="date">2015-10-23 Fri 16:51</span><span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</span>
</div>
</body>
</html>
